[
  {
    "slug": "memorado",
    "name": "Memorado",
    "image": "memorado",
    "what-it-does": "Working out the body is a popular daily routine for many people. It helps them to keep in shape, relax and stay healthy. It is possible to do the same for your brain in order to enhance your memory and concentration abilities. Memorado provides you with an on-line training and games specifically designed for this purpose.",
    "business-initiatives": "Memorado needed a support in building MVP within a short deadline",
    "what-we-did": [
      "Helped to design the core application and provided technical advice to Memorado’s CTO",
      "Helped with scaling their product when it went viral",
      "Designed the product as multilingual from the ground up, which allowed it to gain popularity all over the world",
      "Switched the development focus from web application to API server following the pivot based on analysis of users’ demographics and behaviour",
      "Provided dedicated database replica to be used for statistical data analysis, supporting business decisions without sacrificing the performance of production system",
      "Helped with hiring new technical lead who was our replacement",
      "Handed over the development to their local team",
      "Provided technical expertise and talent",
      "Product development for two years"
    ],
    "what-they-achieved": [
      "MVP in 4 months, as promised in our estimates, which helped them to raise money from investors",
      "Seed funding ($1.3M) after growing customer base to 1M - https://www.crunchbase.com/organization/memorado#/entity (section funding rounds)",
      "Later on Series A funding ($3.3M), still during our cooperation",
      "1M customers acquired in 10 months - since the beginning of development",
      "Product is being used in 39 countries, many of them outside Europe and North America, like India, Saudi Arabia, Japan, Australia, etc"
    ],
    "tech-stack": [
      "Ruby",
      "Rails",
      "jQuery",
      "Bootstrap",
      "Sidekiq",
      "OAuth 2",
      "Adyen",
      "WebTranslateIt",
      "Redis",
      "PostgreSQL"
    ],
    "project-id": 3,
    "color-start": "#f6a623",
    "color-end": "#F2901A"
  },
  {
    "slug": "bookingsync",
    "name": "BookingSync",
    "image": "bookingsync",
    "what-it-does": "BookingSync is a vacation rental software dedicated for property managers which solves the problem of renting properties. There are multiple channels used by  travellers to make reservations, however, rentals management without a centralized application is highly cumbersome. BookingSync solves exactly that problem seamlessly and improves marketing process. Thanks to BookingSync, property owners and agents are able to save time and book more.",
    "business-initiatives": "BookingSync needed team of experienced consultants to develop and extend its core functionality.",
    "what-we-did-paragraphs": [
      "We were first approached by BookingSync for a short job of building an OAuth 2 provider to authorize and authenticate a new version of their API. The scope of our work quickly grew to include planning and implementing that API, along with making sure it’s done in a secure and scalable way.",
      "This API allowed us to build apps that extended the core functionality of BookingSync without making changes to the main application. Thanks to that, we were able to build full two-way integrations with multiple channels, such as Booking.com, HomeAway and Airbnb, which some competitors can’t match even a year later.",
      "Along the way, we increased our involvement up to 7 developers during the peak. We helped improve all areas of the application. We took responsibility for the technical side, allowing the BookingSync team to focus on business development and working with customers."
    ],
    "what-they-achieved": [
      "A growing community of developers building apps using the new API",
      "Reduced time for building integrations for new channels to about 30 days",
      "PCI DSS compliant architecture for credit card payments processing"
    ],
    "tech-stack": [
      "Ruby",
      "Rails",
      "Ember.js",
      "JSONAPI",
      "OAuth 2",
      "Sidekiq",
      "Amazon Web Services",
      "Docker",
      "Redis",
      "PostgreSQL"
    ],
    "project-id": 1,
    "color-start": "#4CC7FF",
    "color-end": "#14A1DF"
  },
  {
    "slug": "certace",
    "name": "Certace",
    "image": "certace",
    "what-it-does": "<a href='https://www.certace.com'>certace</a> is the leading digital marketplace for data science projects. By connecting ace data experts (Machine Learning Scientists, Data Architects, Data Engineers, Information Strategists etc.) with exciting business projects or permanent jobs, certace helps organizations advance through descriptive, predictive and prescriptive data insights. Whether it is defining a data roadmap or creating a proof of conecpt (POC), certace finds the right expert for their clients without incurring the long-term costs associated with a permanent hire.",
    "business-initiatives": "certace needed a support in building MVP within a short deadline",
    "what-we-did": [
      "Designed the core application",
      "Delivered a streamlined, unified code base, fully covered with automated tests",
      "Designed user acquisition flow containing self-assessment, dedicated exam with peer interview system",
      "Delivered project acquisition flow provided by potential clients",
      "Designed user interface for mobile devices",
      "Provided technical expertise and talent"
    ],
    "what-they-achieved": [
      "MVP in 4.5 months",
      "Raised a seed financing round",
      "Spendings associated with recruiting a web developer saved",
      "A small internal team could focus 100% on the business operations"
    ],
    "tech-stack": [
      "Ruby",
      "Rails",
      "Vue.js",
      "Google APIs",
      "Sidekiq",
      "Heroku",
      "Redis",
      "PostgreSQL"
    ],
    "project-id": 5,
    "color-start": "#4497C1",
    "color-end": "#2F769A"
  },
  {
    "slug": "vehiculum",
    "name": "Vehiculum",
    "image": "vehiculum",
    "what-it-does": "Vehiculum is the first digital solution hassle-free car leasing. The platform empowers customers to compare multiple models and leasing offers in real-time. Beside the price comparison it also offer additional features such as contract management, which mainly supports companies with small fleets to manage their carfleet.",
    "business-initiatives": "Vehiculum was looking for a team for building an MVP and further product  development and optimisation.",
    "what-we-did": [
      "Refactored monolithic codebase into proper namespaces (admin panel, dealer panel, customer panel)",
      "Covered application with good quality tests",
      "Improved code quality",
      "Reimplemented and refactored existing features to make them work with new database structure",
      "Moved application to Heroku platform",
      "Analyzed the existing front-end code and provided refactoring plan",
      "Restructured the front-end architecture to allow more efficient development",
      "Created pattern library to standardize the front-end code and make it easier to keep the UI consistent",
      "Evangelised best practices in writing high quality reusable front-end code",
      "Collaborated with internal front-end developer (sharing knowledge, pair programming sessions and code review, planning work)",
      "Worked with internal designers (providing feedback on designs about UX, consistency with existing elements and the estimated implementation time)",
      "Provided technical expertise",
      "Provided best practices regarding collaboration in a project"
    ],
    "what-they-achieved": [
      "A web application which won the first customers",
      "Gained seed funding for further development",
      "Demo user panel built which was used during a show at a conference",
      "Ensured better code quality",
      "Internal tech team educated"
    ],
    "tech-stack": [
      "Ruby",
      "Rails",
      "Bootstrap",
      "Sidekiq",
      "Heroku",
      "Cloudinary",
      "Redis",
      "PostgreSQL"
    ],
    "project-id": 6,
    "color-start": "#D5C19D",
    "color-end": "#C6AA79"
  },
  {
    "slug": "shelly-cloud",
    "name": "Shelly Cloud",
    "image": "shelly-cloud",
    "what-it-did": "Shelly Cloud started in 2010. We built it as Ragnarson to solve the problems we had when deploying apps that we developed for our customers. In 2012 we decided to spin it off into a separate business. It provided high-speed servers, really simple deployment and full control over the cloud layout for developers. After over 6 years, Shelly Cloud was shut down on March 31st, 2016.",
    "business-initiatives": "Shelly Cloud was our own initiative to provide a Ruby application hosting service that made deployments painless",
    "what-we-did": [
      "A dedicated, automated and scalable infrastructure available over two continents  (EU, NA)",
      "Ruby on Rails and Chef system for scheduling, deploying and billing provided services",
      "PostgreSQL, MySQL, MongoDB, Elasticsearch and Redis databases with automatic and free backups",
      "Caching at HTTP level using Varnish",
      "Application level cache with Memcached",
      "Persistent network storage available to all application processes based on Ceph and GlusterFS",
      "Dynamic Web UI built with Angular and InuitCSS framework",
      "Custom CLI tool written in Ruby providing full control over the cloud and robust development process",
      "24/7 monitoring over entire infrastructure and dedicated on-call team",
      "Thousands of hours of all tier customer support ;-)"
    ],
    "what-we-achieved": [
      "Learnt how to built products, both from the technical and business perspectives",
      "Gained knowledge required to build a complete hosting solution",
      "Mastered automation using Chef",
      "Acquired skills to provide better support to an end-user customer",
      "Long-standing business partners"
    ],
    "tech-stack": [
      "Ceph",
      "Chef",
      "CloudFlare",
      "DNSimple",
      "Elasticsearch",
      "GlusterFS",
      "MongoDB",
      "Openstack",
      "PostgreSQL",
      "Rails",
      "Redis",
      "Ruby",
      "Varnish"
    ],
    "project-id": 7,
    "color-start": "#4a4a4a",
    "color-end": "#2e3a41"
  },
  {
    "slug": "bgrimm-platform",
    "name": "B.Grimm platform",
    "image": "platform",
    "what-it-does": "The platform is the basis of all TCP/IP based businesses of <a href='http://bgrimmgroup.com'>B.Grimm International</a> such as <a href='https://masii.com'>masii.com</a> or <a href='http://getmii.com'>getmii.com</a>. It’s a complete hosting solution. Combines multiple High Availability services with no single point of failure. Provides tools for Software Developers to perform a variety of administration operations without extended DevOps experience. It's vendor-independent, which allows easy expansion over new regions. Includes integration tests suite that ensures integrity on the infrastructure level even before deploying any physical resources.",
    "business-initiatives": "Need to get a flexible and reliable hosting platform to deploy large-scale products accross the globe.",
    "what-we-did": [
      "The core platform based on Deis Workflow project. Provides Git-based deployment over Heroku buildpacks on top of scalable Kubernetes clusters. Encourages micro-services application design.",
      "Extra services configured with the best High Availability practices. Including replicated databases, load balancers and external monitoring.",
      "Developed an application to handle the platform internals.",
      "Tools for managing the platform by developers themselves. For example, to create, backup and restore of application’s databases.",
      "Centralized log storage based on The Elastic Stack. Allows developers to search, analyze and visualize logs for simple debugging or more advanced analysis.",
      "Maintained the infrastructure for over 3 continents (Asia, USA, Europe) on top of 36 instances.",
      "Built dedicated DevOps team to support internal developers.",
      "Provided the on-call support in case of emergencies."
    ],
    "what-they-achieved": [
      "Faster time to market",
      "Professional support for a long-term technology project planning",
      "A reliable platform that supports most of the modern web development technologies",
      "Reduced costs of building an internal team of DevOps Engineers ",
      "Quick and easy expansion over new regions"
    ],
    "tech-stack": [
      "AWS",
      "Chef",
      "CoreOS",
      "Data Dog",
      "Deis Workflow",
      "Ejabberd",
      "Elasticsearch",
      "Kibana",
      "Kubernetes",
      "Logstash",
      "PostgreSQL",
      "Ruby on Rails"
    ],
    "project-id": 8,
    "color-start": "#337ab7",
    "color-end": "#337ab7"
  },
  {
    "slug": "melodie",
    "name": "Melodie",
    "image": "melodie",
    "what-it-does": "Melodie is an independent online production music library. They non-exclusively license professional music tracks primarily to television, advertising and other media companies. Their mission is simple: to become the world’s leading online provider of high-quality production music.",
    "business-initiatives": "For this project, the challenge was to find a company that truly understood the importance of UX. We required not only a fast and intuitive music search engine, but one which made the process of finding the right track effortless.",
    "what-we-did": [
      "Rebrand existing app and prepare it for new market",
      "Implement new features and slim down existing ones",
      "Improve code quality",
      "Analyze existing front-end code and provided refactoring plan",
      "Reimplement and refactored existing features to make them work with new database structure",
      "Advanced search module for songs based on multiple criteria",
      "Built-in player of uploaded songs",
      "Integrated online payments (Stripe) and accounting (Xero)",
      "Convenient and functional user interface with the use of React technology",
      "Provide technical expertise",
      "Integration with Amazon S3",
      "Advanced tagging system"
    ],
    "what-they-achieved": [
      "Full company rebranding",
      "Redesign of existing app",
      "Redefined, simplified UX and music search logic",
      "Creation of new functional interface",
      "Recruitment of professional composers from around the world",
      "Successful launch in Australasia",
      "Web application winning first customers"
    ],
    "tech-stack": [
      "Ruby",
      "Rails",
      "Bootstrap",
      "React JS",
      "Elasticsearch",
      "HAML",
      "PostgreSQL",
      "Amazon Web Services",
      "Stripe",
      "WickedPDF"
    ],
    "project-id": 9,
    "color-start": "#00c0a5",
    "color-end": "#00c0a5"
  },
  {
    "slug": "crypto-investia",
    "name": "Crypto Investia",
    "image": "crypto-investia",
    "what-it-does": "<a href='https://cryptoinvestia.io/'>Crypto Investia</a> is a new kind of token-based organization. It allows regular people to invest in cryptocurrency markets without the time-consuming process of learning about the technology and market. Funds collected during Initial Coin Offering are invested mostly in crypto assets. Investments are made by people with extensive practical knowledge and track records, from both the crypto and financial markets. Token holders are allowed to participate in the annual profit share.",
    "business-initiatives": "The need to create an ERC-20 compliant token and Initial Coin Offering smart contract for its distribution.",
    "what-we-did": [
      "Developed an ERC-20 compliant token and an Initial Coin Offering smart contract responsible for distribution of the token.",
      "As customers of Crypto Investia are not tech savvy crypto users we had to find a solution to make their investment as easy as possible.",
      "We also made it independent from Ether price fluctuation. As a result, the only accepted payment option in ICO is a special token bound to local fiat currency."
    ],
    "what-they-achieved": [
      "The ability to collect investments that is easy to handle by a non-tech tech savvy investor for whom it is the first interaction with the cryptocurrency markets"
    ],
    "tech-stack": [
      "Ethereum blockchain",
      "ERC-20 tokens",
      "Solidity",
      "Truffle",
      "OpenZeppelin"
    ],
    "project-id": 10,
    "color-start": "#51a4da",
    "color-end": "#51a4da"
  },
  {
    "slug": "bookingsync-platform",
    "name": "The BookingSync's platform",
    "image": "bookingsync-platform",
    "what-it-does": "Completely modular hosting solution. Built without a single point of failure. Deployments and basic application-related tasks may be performed without administrators assistance. The platform is completely vendor agnostic and due to the extensive set of automated tests, it can be easily migrated to any other provider.",
    "business-initiatives": "BookingSync needed to migrate its fast-growing set of applications to the infrastructure customized to their needs. Current infrastructure was outgrown by the application. Due to environment limitations, ruby was locked to the same version for all the applications. It was impossible to upgrade any stack component (database, monitoring, load balancer) without upgrading the whole stack. Horizontal scaling was expensive time-wise - it took up to an hour to add a new server.",
    "what-we-did": [
      "Kubernetes based (Deis Workflow) application hosting platform",
      "Custom Deis components to ease developers with common tasks",
      "Custom frontend to overcome Deis and AWS ELB limitations",
      "Easy and fast deployments with git, docker images or plain Dockerfile",
      "Any kind of application can be deployed on the platform, regardless of the language or the type",
      "Support for multiple replicated PostgreSQL and Redis clusters with easy, seamless failover",
      "ELK-based centralized log storage for applications and system services",
      "Detailed monitoring of each service",
      "Repeatable deployment of each component with Terraform and Chef",
      "Detailed documentation for each component",
      "Migration from previous provider with minimal downtime for each service",
      "On-call duty and 24/7 support"
    ],
    "what-they-achieved": [
      "Faster deployments",
      "Better control over infrastructure",
      "Modular infrastructure",
      "Easy and quick scaling",
      "Data separation",
      "Better application performance",
      "24/7 proactive support",
      "No vendor lock-in",
      "Service consolidation",
      "Easier future expandability",
      "Lower cost of infrastructure support in comparison to the internal team"
    ],
    "tech-stack": [
      "AWS",
      "Chef",
      "DataDog",
      "Deis Workflow",
      "Docker",
      "Elastic",
      "Etcd",
      "Flannel",
      "HAProxy",
      "Kibana",
      "Kubernetes",
      "Logstash",
      "Nginx",
      "PostgreSQL",
      "Redis",
      "Terraform",
      "Ubuntu"
    ],
    "project-id": 1,
    "color-start": "#2DB859",
    "color-end": "#2DB859"
  },
  {
    "slug": "sensor-management",
    "name": "Software Solutions for IoT Sensor Management",
    "image": "company",
    "what-it-does": "Company that provides software solutions for IoT sensor installation and maintenance. Applied by energy suppliers and the housing industry. They offer a mobile tool for sensor installation, seamless documentation and automated data logging. An additional desktop application enables control and maintenance of gateways and sensors.",
    "business-initiatives": "Develop a platform for passing data from sensors to a gateway, sending it to a server for processing and analysis",
    "what-we-did": [
      "Replace existing ASP.NET prototype with production-grade backend written in Ruby on Rails.",
      "Single-page web application for the platform management and sensor installation.",
      "Support for over 95% of sensors available on the market for the industry.",
      "Code reviews in additional projects.",
      "Actively participate in the design and planning of the platform advancement."
    ],
    "what-they-achieved": [
      "User-friendly frontend - tailored for the case",
      "Stable, scalable and cost efficient backend API",
      "High level support regarding product development"
    ],
    "tech-stack": [
      "Ruby on Rails",
      "Vue.js",
      "Cassandra",
      "Redis",
      "PostgreSQL",
      "MsSQL",
      "MQTT"
    ],
    "project-id": 11,
    "color-start": "#51a4da",
    "color-end": "#51a4da"
  },
  {
    "slug": "growthmentor",
    "name": "GrowthMentor",
    "image": "growthmentor",
    "what-it-does": "Growthmentor is an on-demand platform where you can connect with hand-picked growth experts for 1:1 call to help grow their business. It’s an easy way for startups to get tactical advice from curated growth marketers and tech startup founders. The user can filter mentors based on what tools they're proficient at and book screenshare calls with them instantly. On the other hand, provides potential mentors an easy to use platform for sharing the knowledge and an additional source of income.",
    "business-initiatives": "They needed a team to put their vision into frames. Experienced enough, to quickly settle it on the market.",
    "what-we-did": [
      "Built a responsive frontend based on mockups designed by the client.",
      "Design and develop a backend application.",
      "Dynamic features and integrations - e.g. schedule a call from the page.",
      "Assistance from the earliest stages of designing the workflow that shortens time to market."
    ],
    "what-they-achieved": [
      "MVP in just 6 months"
    ],
    "tech-stack": [
      "Ruby on Rails",
      "Vue.js",
      "PostgreSQL",
      "Sidekiq",
      "Redis"
    ],
    "project-id": 12,
    "color-start": "#51a4da",
    "color-end": "#51a4da"
  }
]
