[
  {
    "id": 1,
    "name": "BookingSync",
    "link": "http://bookingsync.com",
    "logo": "bookingsync.png",
    "testimonial": {
      "author": "Sébastien Grosjean, CEO",
      "text": "After cooperating with many different web agencies, I finally came across Ragnarson. They provided me with meticulous and skilled developers who helped me achieve high quality work while meeting deadlines. They have been able to raise my expectations which help us do better for our customers.",
      "avatar": "1.jpg"
    }
  },
  {
    "id": 2,
    "name": "Locafox",
    "link": "https://www.locafox.de",
    "logo": "locafox.png",
    "testimonial": {
      "author": "Rob Morgan, CTO",
      "text": "Choosing to work with Ragnarson was crucial for the execution of our product. Through close collaboration we were able to rapidly launch an MVP in weeks, not months, test it and begin working on our greater platform.",
      "avatar": "2.jpg"
    }

  },
  {
    "id": 3,
    "name": "Memorado",
    "link": "http://memorado.de",
    "logo": "memorado.png",
    "testimonial": {
      "author": "Marius Jeuck, Co-Founder",
      "text": "Ragnarson did exactly what we were looking for. In less than 4 months of development they finished an MVP, three days before the deadline. It gave us a significant boost in convincing investors.",
      "avatar": "3.jpg"
    }
  },
  {
    "id": 4,
    "name": "Restaurant Kritik",
    "link": "http://restaurant-kritik.de",
    "logo": "restaurant-kritik.png",
    "testimonial": {
      "author": "Carsten Jutzi, CEO",
      "text": "Long term relationship with Ragnarson (almost 5 years) was very profitable for me. Developers and administrators constantly support our product, develop and maintain the application and take care of IT infrastructure. I can focus on my business goals and not worry about a technicality.",
      "avatar": "4.png"
    }
  },
  {
    "id": 5,
    "name": "certace",
    "link": "https://www.certace.com/",
    "logo": "certace.svg",
    "testimonial": {
      "author": "Sibylle Luther, Co-Founder",
      "text": "I really appreciated the collaboration with Ragnarson. They worked very efficiently, always met the deadlines and had good input on certain features for which we needed a second opinion. I can recommend Ragnarson for any startup who wants to scale fast.",
      "avatar": "5.jpg"
    }
  },
  {
    "id": 6,
    "name": "Vehiculum",
    "link": "https://www.vehiculum.de/",
    "logo": "vehiculum.png",
    "testimonial": {
      "author": "Guy Moller, Co-founder & CTO",
      "text": "Ragnarson guys made an awesome job. They took care to improve a quality code thanks to that Vehiculum is ready for further development and scaling its business.",
      "avatar": "6.jpg"
    }
  },
  {
    "id": 7,
    "name": "Shelly Cloud",
    "link": "https://www.shellycloud.com/",
    "tweets": [
      "https://twitter.com/andrzejkrzywda/status/514383944264208385",
      "https://twitter.com/bscht/status/627899888928489472",
      "https://twitter.com/askrapp/status/609107442778173441 ",
      "https://twitter.com/ciaranarcher/status/596779366031499264",
      "https://twitter.com/hacken_in/status/549894666230185984",
      "https://twitter.com/zaiste/status/494815273867046912",
      "https://twitter.com/markusschwed/status/578919393154961408",
      "https://twitter.com/rahoulb/status/560813187243999232",
      "https://twitter.com/wkruszewski/status/535881163257442305",
      "https://twitter.com/_tjeden/status/532899037717221376",
      "https://twitter.com/keleshev/status/331854017963642880"
    ]
  },
  {
    "id": 8,
    "name": "B.Grimm",
    "link": "https://masii.co.th",
    "logo": "masii.svg",
    "testimonial": {
      "author": "Matthias Jurgens, Group CTO B.Grimm Joint Ventures Ltd., Founder and CEO of masii.com",
      "text": "After working on the platform for 2 years now, I'm honestly impressed of the seamless way to work this quite slim platform. It's reliability, scalability and the fact that we can run it with a very small dev-ops team.</br> Thanks to our dear friends from Ragnarson - great job!",
      "avatar": "8.png"
    }
  },
  {
    "id": 9,
    "name": "Melodie",
    "link": "https://melod.ie/",
    "logo": "melodie.png",
    "testimonial": {
      "author": "Evan Buist, Director",
      "text": "Ragnarson’s well-structured, agile workflow is by far the best I've experienced. They have a unique corporate philosophy focused on communication, mutual respect, openness and commitment to each project. This was absolutely reflected in the positive interactions I had with staff members as well as the quality of work delivered.",
      "avatar": "9.png"
    }
  },
  {
    "id": 10,
    "name": "Crypto Investia",
    "link": "https://cryptoinvestia.io/",
    "logo": "blank.png",
    "testimonial": {
      "author": "Tomasz Rozmus, CEO Crypto Investia",
      "text": "We are very happy and satisfied with our collaboration with Ragnarson. We were able to focus 100% on our core business as the technological stack was covered by the Ragnarson team. What I really appreciate is the clear understanding of our business needs and the preparation of non-trivial, non-standard technical solutions as a response to them. It is especially important in virgin markets, like blockchain and cryptocurrencies.",
      "avatar": "10.png"
    }
  }
]
