[
  {
    "id": 1,
    "name": "BookingSync",
    "link": "http://bookingsync.com",
    "logo": "bookingsync.png",
    "testimonial": {
      "author": "Sébastien Grosjean, CEO",
      "text": "After cooperating with many different web agencies, I finally came across Ragnarson. They provided me with meticulous and skilled developers who helped me achieve high quality work while meeting deadlines. They have been able to raise my expectations which help us do better for our customers.",
      "avatar": "1.jpg"
    }
  },
  {
    "id": 2,
    "name": "Locafox",
    "link": "https://www.locafox.de",
    "logo": "locafox.png",
    "testimonial": {
      "author": "Rob Morgan, CTO",
      "text": "Choosing to work with Ragnarson was crucial for the execution of our product. Through close collaboration we were able to rapidly launch an MVP in weeks, not months, test it and begin working on our greater platform.",
      "avatar": "2.jpg"
    }
  },
  {
    "id": 3,
    "name": "Memorado",
    "link": "http://memorado.de",
    "logo": "memorado.png",
    "testimonial": {
      "author": "Marius Jeuck, Co-Founder",
      "text": "Ragnarson did exactly what we were looking for. In less than 4 months of development they finished an MVP, three days before the deadline. It gave us a significant boost in convincing investors.",
      "avatar": "3.jpg"
    }
  },
  {
    "id": 4,
    "name": "Restaurant Kritik",
    "link": "http://restaurant-kritik.de",
    "logo": "restaurant-kritik.png",
    "testimonial": {
      "author": "Carsten Jutzi, CEO",
      "text": "Long term relationship with Ragnarson (almost 5 years) was very profitable for me. Developers and administrators constantly support our product, develop and maintain the application and take care of IT infrastructure. I can focus on my business goals and not worry about a technicality.",
      "avatar": "4.png"
    }
  },
  {
    "id": 5,
    "name": "certace",
    "link": "https://www.certace.com/",
    "logo": "certace.svg",
    "testimonial": {
      "author": "Sibylle Luther, Co-Founder",
      "text": "I really appreciated the collaboration with Ragnarson. They worked very efficiently, always met the deadlines and had good input on certain features for which we needed a second opinion. I can recommend Ragnarson for any startup who wants to scale fast.",
      "avatar": "5.jpg"
    }
  },
  {
    "id": 6,
    "name": "Vehiculum",
    "link": "https://www.vehiculum.de/",
    "logo": "vehiculum.png",
    "testimonial": {
      "author": "Guy Moller, Co-founder & CTO",
      "text": "Ragnarson guys made an awesome job. They took care to improve a quality code thanks to that Vehiculum is ready for further development and scaling its business.",
      "avatar": "6.jpg"
    }
  }
]
